waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_gptim.h
/**
  *******************************************************************************************************
  * @file    fm33fk5xx_fl_gptim.h
  * @author  FMSH Application Team
  * @brief   Head file of GPTIM FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FK5XX_FL_GPTIM_H
#define __FM33FK5XX_FL_GPTIM_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fk5xx_fl_def.h"
/** @addtogroup FM33FK5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup GPTIM_FL_ES_INIT GPTIM Exported Init structures
  * @{
  */

/**
  * @brief GPTIM Init Sturcture Definition
  */
typedef struct
{
    /** 预分频系数 */
    uint32_t prescaler;
    /** 计数模式 */
    uint32_t counterMode;
    /** 自动重装载值 */
    uint32_t autoReload;
    /** 预装载使能 */
    uint32_t autoReloadState;
    /** 定时器分频系数与数字滤波器所使用的采样时钟分频比*/
    uint32_t clockDivision;

} FL_GPTIM_InitTypeDef;

/**
  * @brief GPTIM SlaveMode Init Sturcture Definition
  */
typedef struct
{
    /** ITRx 源*/
    uint32_t ITRSourceGroup;
    /** 外部时钟源模式 */
    uint32_t slaveMode;
    /** 输入触发信号选择 */
    uint32_t triggerSrc;
    /** Trigger 延迟*/
    uint32_t triggerDelay;

} FL_GPTIM_SlaveInitTypeDef;

/**
  * @brief  GPTIM Input Capture Init Structure Definition
  */
typedef struct
{
    /** 输入捕获使能 */
    uint32_t captureState;
    /** 通道输入选择 */
    uint32_t ITSelect;
    /** 输入捕获极性 */
    uint32_t ICPolarity;
    /** 通道映射激活的输入选择 */
    uint32_t ICActiveInput;
    /** 输入分频 */
    uint32_t ICPrescaler;
    /** 输入滤波 */
    uint32_t ICFilter;

} FL_GPTIM_IC_InitTypeDef;

/**
  * @brief  GPTIM ETR Init Structure Definition
  */
typedef struct
{
    /** 外部触发使能 */
    uint32_t useExternalTrigger;
    /** 外部时钟滤波 */
    uint32_t ETRFilter;
    /** 外部时钟分频 */
    uint32_t ETRClockDivision;
    /** 外部时钟触发极性 */
    uint32_t ETRPolarity;
    /** ETR输入选择信号 */
    uint32_t ETRInput;
} FL_GPTIM_ETR_InitTypeDef;

/**
  * @brief  GPTIM Output Compare Init Structure Definition
  */
typedef struct
{
    /** 比较输出模式 */
    uint32_t OCMode;
    /** 比较输出通道快速模式使能 */
    uint32_t OCFastMode;
    /** 输出比较预装载 */
    uint32_t OCPreload;
    /** 通道比较值 */
    uint32_t compareValue;
    /** 比较输出极性 */
    uint32_t OCPolarity;
    /** ETR清0使能 */
    uint32_t OCETRFStatus;

} FL_GPTIM_OC_InitTypeDef;

#define    GPTIM_CR1_UIFREMAP_Pos                                 (11U)
#define    GPTIM_CR1_UIFREMAP_Msk                                 (0x1U << GPTIM_CR1_UIFREMAP_Pos)
#define    GPTIM_CR1_UIFREMAP                                     GPTIM_CR1_UIFREMAP_Msk

#define    GPTIM_CR1_CKD_Pos                                      (8U)
#define    GPTIM_CR1_CKD_Msk                                      (0x3U << GPTIM_CR1_CKD_Pos)
#define    GPTIM_CR1_CKD                                          GPTIM_CR1_CKD_Msk

#define    GPTIM_CR1_ARPE_Pos                                     (7U)
#define    GPTIM_CR1_ARPE_Msk                                     (0x1U << GPTIM_CR1_ARPE_Pos)
#define    GPTIM_CR1_ARPE                                         GPTIM_CR1_ARPE_Msk

#define    GPTIM_CR1_CMS_Pos                                      (5U)
#define    GPTIM_CR1_CMS_Msk                                      (0x3U << GPTIM_CR1_CMS_Pos)
#define    GPTIM_CR1_CMS                                          GPTIM_CR1_CMS_Msk

#define    GPTIM_CR1_DIR_Pos                                      (4U)
#define    GPTIM_CR1_DIR_Msk                                      (0x1U << GPTIM_CR1_DIR_Pos)
#define    GPTIM_CR1_DIR                                          GPTIM_CR1_DIR_Msk

#define    GPTIM_CR1_OPM_Pos                                      (3U)
#define    GPTIM_CR1_OPM_Msk                                      (0x1U << GPTIM_CR1_OPM_Pos)
#define    GPTIM_CR1_OPM                                          GPTIM_CR1_OPM_Msk

#define    GPTIM_CR1_URS_Pos                                      (2U)
#define    GPTIM_CR1_URS_Msk                                      (0x1U << GPTIM_CR1_URS_Pos)
#define    GPTIM_CR1_URS                                          GPTIM_CR1_URS_Msk

#define    GPTIM_CR1_UDIS_Pos                                     (1U)
#define    GPTIM_CR1_UDIS_Msk                                     (0x1U << GPTIM_CR1_UDIS_Pos)
#define    GPTIM_CR1_UDIS                                         GPTIM_CR1_UDIS_Msk

#define    GPTIM_CR1_CEN_Pos                                      (0U)
#define    GPTIM_CR1_CEN_Msk                                      (0x1U << GPTIM_CR1_CEN_Pos)
#define    GPTIM_CR1_CEN                                          GPTIM_CR1_CEN_Msk

#define    GPTIM_CR2_TI1S_Pos                                     (7U)
#define    GPTIM_CR2_TI1S_Msk                                     (0x1U << GPTIM_CR2_TI1S_Pos)
#define    GPTIM_CR2_TI1S                                         GPTIM_CR2_TI1S_Msk

#define    GPTIM_CR2_MMS_Pos                                      (4U)
#define    GPTIM_CR2_MMS_Msk                                      (0x200007U << GPTIM_CR2_MMS_Pos)
#define    GPTIM_CR2_MMS                                          GPTIM_CR2_MMS_Msk

#define    GPTIM_CR2_CCDS_Pos                                     (3U)
#define    GPTIM_CR2_CCDS_Msk                                     (0x1U << GPTIM_CR2_CCDS_Pos)
#define    GPTIM_CR2_CCDS                                         GPTIM_CR2_CCDS_Msk

#define    GPTIM_SMCR_SMSPS_Pos                                   (25U)
#define    GPTIM_SMCR_SMSPS_Msk                                   (0x1U << GPTIM_SMCR_SMSPS_Pos)
#define    GPTIM_SMCR_SMSPS                                       GPTIM_SMCR_SMSPS_Msk

