waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_gptim.h
#define    GPTIM_ECR_FIDX_Pos                                     (5U)
#define    GPTIM_ECR_FIDX_Msk                                     (0x1U << GPTIM_ECR_FIDX_Pos)
#define    GPTIM_ECR_FIDX                                         GPTIM_ECR_FIDX_Msk

#define    GPTIM_ECR_IDIR_Pos                                     (1U)
#define    GPTIM_ECR_IDIR_Msk                                     (0x3U << GPTIM_ECR_IDIR_Pos)
#define    GPTIM_ECR_IDIR                                         GPTIM_ECR_IDIR_Msk

#define    GPTIM_ECR_INDEX_EN_Pos                                 (0U)
#define    GPTIM_ECR_INDEX_EN_Msk                                 (0x1U << GPTIM_ECR_INDEX_EN_Pos)
#define    GPTIM_ECR_INDEX_EN                                     GPTIM_ECR_INDEX_EN_Msk

#define    GPTIM_TISEL_TISEL_Pos                                  (0U)
#define    GPTIM_TISEL_TISEL_Msk                                  (0xfU << GPTIM_TISEL_TISEL_Pos)
#define    GPTIM_TISEL_TISEL                                      GPTIM_TISEL_TISEL_Msk

#define    GPTIM_AFR_ETRSEL_Pos                                   (20U)
#define    GPTIM_AFR_ETRSEL_Msk                                   (0xfU << GPTIM_AFR_ETRSEL_Pos)
#define    GPTIM_AFR_ETRSEL                                       GPTIM_AFR_ETRSEL_Msk

#define    GPTIM_AFR_OCCR_SEL_Pos                                 (16U)
#define    GPTIM_AFR_OCCR_SEL_Msk                                 (0x7U << GPTIM_AFR_OCCR_SEL_Pos)
#define    GPTIM_AFR_OCCR_SEL                                     GPTIM_AFR_OCC1R_SEL_Msk

#define    GPTIM_DCR_DBL_Pos                                      (8U)
#define    GPTIM_DCR_DBL_Msk                                      (0x1fU << GPTIM_DCR_DBL_Pos)
#define    GPTIM_DCR_DBL                                          GPTIM_DCR_DBL_Msk

#define    GPTIM_DCR_DBA_Pos                                      (0U)
#define    GPTIM_DCR_DBA_Msk                                      (0x1fU << GPTIM_DCR_DBA_Pos)
#define    GPTIM_DCR_DBA                                          GPTIM_DCR_DBA_Msk

#define    FL_GPTIM_CHANNEL_1                                     (0x0U)
#define    FL_GPTIM_CHANNEL_2                                     (0x1U)
#define    FL_GPTIM_CHANNEL_3                                     (0x2U)
#define    FL_GPTIM_CHANNEL_4                                     (0x3U)

#define    FL_GPTIM_TI0                                           (0x0U)
#define    FL_GPTIM_TI1                                           (0x1U)
#define    FL_GPTIM_TI2                                           (0x2U)
#define    FL_GPTIM_TI3                                           (0x3U)

#define    FL_GPTIM_CLK_DIVISION_DIV1                             (0x0U << GPTIM_CR1_CKD_Pos)
#define    FL_GPTIM_CLK_DIVISION_DIV2                             (0x1U << GPTIM_CR1_CKD_Pos)
#define    FL_GPTIM_CLK_DIVISION_DIV4                             (0x2U << GPTIM_CR1_CKD_Pos)

#define    FL_GPTIM_COUNTER_ALIGNED_EDGE                          (0x0U << GPTIM_CR1_CMS_Pos)
#define    FL_GPTIM_COUNTER_ALIGNED_CENTER_DOWN                   (0x1U << GPTIM_CR1_CMS_Pos)
#define    FL_GPTIM_COUNTER_ALIGNED_CENTER_UP                     (0x2U << GPTIM_CR1_CMS_Pos)
#define    FL_GPTIM_COUNTER_ALIGNED_CENTER_UP_DOWN                (0x3U << GPTIM_CR1_CMS_Pos)

#define    FL_GPTIM_COUNTER_DIR_UP                                (0x0U << GPTIM_CR1_DIR_Pos)
#define    FL_GPTIM_COUNTER_DIR_DOWN                              (0x1U << GPTIM_CR1_DIR_Pos)

#define    FL_GPTIM_ONE_PULSE_MODE_CONTINUOUS                     (0x0U << GPTIM_CR1_OPM_Pos)
#define    FL_GPTIM_ONE_PULSE_MODE_SINGLE                         (0x1U << GPTIM_CR1_OPM_Pos)

#define    FL_GPTIM_UPDATE_SOURCE_REGULAR                         (0x0U << GPTIM_CR1_URS_Pos)
#define    FL_GPTIM_UPDATE_SOURCE_COUNTER                         (0x1U << GPTIM_CR1_URS_Pos)

#define    FL_GPTIM_TRGO_RESET                                    (0x0U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_ENABLE                                   (0x1U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_UPDATE                                   (0x2U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_CC1IF                                    (0x3U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_OC1REF                                   (0x4U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_OC2REF                                   (0x5U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_OC3REF                                   (0x6U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_OC4REF                                   (0x7U << GPTIM_CR2_MMS_Pos)
#define    FL_GPTIM_TRGO_ENCODER                                  (0x200000U << GPTIM_CR2_MMS_Pos)

#define    FL_GPTIM_DMA_REQ_CC                                    (0x0U << GPTIM_CR2_CCDS_Pos)
#define    FL_GPTIM_DMA_REQ_UPDATE                                (0x1U << GPTIM_CR2_CCDS_Pos)

#define    FL_GPTIM_TRIG_SOURCE_UPDATE_EVENT                      (0x0U << GPTIM_SMCR_SMSPS_Pos)
#define    FL_GPTIM_TRIG_SOURCE_INDEX_EVENT                       (0x1U << GPTIM_SMCR_SMSPS_Pos)

#define    FL_GPTIM_SOURCE_OCREF_CLR                              (0x0U << GPTIM_SMCR_OCCS_Pos)
#define    FL_GPTIM_SOURCE_ETRF                                   (0x1U << GPTIM_SMCR_OCCS_Pos)

#define    FL_GPTIM_ETR_POLARITY_NORMAL                           (0x0U << GPTIM_SMCR_ETP_Pos)
#define    FL_GPTIM_ETR_POLARITY_INVERT                           (0x1U << GPTIM_SMCR_ETP_Pos)

#define    FL_GPTIM_ETR_PSC_DIV1                                  (0x0U << GPTIM_SMCR_ETPS_Pos)
#define    FL_GPTIM_ETR_PSC_DIV2                                  (0x1U << GPTIM_SMCR_ETPS_Pos)
#define    FL_GPTIM_ETR_PSC_DIV4                                  (0x2U << GPTIM_SMCR_ETPS_Pos)
#define    FL_GPTIM_ETR_PSC_DIV8                                  (0x3U << GPTIM_SMCR_ETPS_Pos)

#define    FL_GPTIM_ETR_FILTER_DIV1                               (0x0U << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV1_N2                            (0x1U << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV1_N4                            (0x2U << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV1_N8                            (0x3U << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV2_N6                            (0x4U << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV2_N8                            (0x5U << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV4_N6                            (0x6U << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV4_N8                            (0x7U << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV8_N6                            (0x8U << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV8_N8                            (0x9U << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV16_N5                           (0xaU << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV16_N6                           (0xbU << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV16_N8                           (0xcU << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV32_N5                           (0xdU << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV32_N6                           (0xeU << GPTIM_SMCR_ETF_Pos)
#define    FL_GPTIM_ETR_FILTER_DIV32_N8                           (0xfU << GPTIM_SMCR_ETF_Pos)

#define    FL_GPTIM_TRGI_ITR0                                            (0x0U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR1                                        (0x1U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR2                                        (0x2U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR3                                            (0x3U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_TI1F_ED                                         (0x4U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_TI1FP1                                          (0x5U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_TI2FP2                                        (0x6U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ETRF                                      (0x7U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR4                                      (0x10000U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR5                                      (0x10001U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR6                                      (0x10002U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR7                                      (0x10003U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR8                                      (0x10004U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR9                                      (0x10005U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR10                                     (0x10006U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR11                                     (0x10007U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR12                                     (0x20000U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR13                                     (0x20001U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR14                                     (0x20002U << GPTIM_SMCR_TS_Pos)
#define    FL_GPTIM_TRGI_ITR15                                     (0x20003U << GPTIM_SMCR_TS_Pos)

#define    FL_GPTIM_SLAVE_MODE_PROHIBITED                         (0x0U << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_ENCODER_X1_TI1                     (0x1U << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_ENCODER_X2_TI2                     (0x2U << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_ENCODER_X4_TI1TI2                  (0x3U << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_TRGI_RISE_RST                      (0x4U << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_TRGI_HIGH_RUN                      (0x5U << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_TRGI_RISE_RUN                      (0x6U << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_TRGI_CLK                           (0x7U << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_TRGI_RISE_RST_RUN                  (0x8U << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_TRGI_HIGH_RISE_RUN                 (0x9U << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_TRGI_ENCODER_CLK_DIR_X2            (0xaU << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_TRGI_ENCODER_CLK_DIR_X1            (0xbU << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_TRGI_ENCODER_CLKWithDIR_X2         (0xcU << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_TRGI_ENCODER_CLKWithDIR_X1         (0xdU << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_QUADRATURE_ENCODER_X1_TI1FP1       (0xeU << GPTIM_SMCR_SMS_Pos)
#define    FL_GPTIM_SLAVE_MODE_QUADRATURE_ENCODER_X1_TI2FP2       (0xfU << GPTIM_SMCR_SMS_Pos)

#define    FL_GPTIM_OC_MODE_FROZEN                                (0x0U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_ACTIVE                                (0x1U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_INACTIVE                              (0x2U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_TOGGLE                                (0x3U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_FORCED_INACTIVE                       (0x4U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_FORCED_ACTIVE                         (0x5U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_PWM1                                  (0x6U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_PWM2                                  (0x7U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_RETRIG_OPM1                           (0x1000U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_RETRIG_OPM2                           (0x1001U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_COMBIME_PWM1                          (0x1004U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_COMBIME_PWM2                          (0x1005U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_DISSYMMETRIC_PWM1                     (0x1006U << GPTIM_CCMR_OCM_Pos)
#define    FL_GPTIM_OC_MODE_DISSYMMETRIC_PWM2                     (0x1007U << GPTIM_CCMR_OCM_Pos)

#define    FL_GPTIM_IC_FILTER_DIV1                                (0x0U << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV1_N2                             (0x1U << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV1_N4                             (0x2U << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV1_N8                             (0x3U << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV2_N6                             (0x4U << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV2_N8                             (0x5U << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV4_N6                             (0x6U << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV4_N8                             (0x7U << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV8_N6                             (0x8U << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV8_N8                             (0x9U << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV16_N5                            (0xaU << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV16_N6                            (0xbU << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV16_N8                            (0xcU << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV32_N5                            (0xdU << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV32_N6                            (0xeU << GPTIM_CCMR_ICF_Pos)
#define    FL_GPTIM_IC_FILTER_DIV32_N8                            (0xfU << GPTIM_CCMR_ICF_Pos)

#define    FL_GPTIM_IC_PSC_DIV1                                   (0x0U << GPTIM_CCMR_ICPSC_Pos)
#define    FL_GPTIM_IC_PSC_DIV2                                   (0x1U << GPTIM_CCMR_ICPSC_Pos)
#define    FL_GPTIM_IC_PSC_DIV4                                   (0x2U << GPTIM_CCMR_ICPSC_Pos)
#define    FL_GPTIM_IC_PSC_DIV8                                   (0x3U << GPTIM_CCMR_ICPSC_Pos)

#define    FL_GPTIM_CHANNEL_MODE_OUTPUT                           (0x0U << GPTIM_CCMR_CCS_Pos)
#define    FL_GPTIM_CHANNEL_MODE_INPUT_NORMAL                     (0x1U << GPTIM_CCMR_CCS_Pos)
#define    FL_GPTIM_CHANNEL_MODE_INPUT_CROSSOVER                  (0x2U << GPTIM_CCMR_CCS_Pos)
#define    FL_GPTIM_CHANNEL_MODE_INPUT_TRC                        (0x3U << GPTIM_CCMR_CCS_Pos)

#define    FL_GPTIM_OCN_POLARITY_NORMAL                           (0x0U << GPTIM_CCER_CCONP_Pos)
#define    FL_GPTIM_OCN_POLARITY_INVERT                           (0x1U << GPTIM_CCER_CCONP_Pos)

#define    FL_GPTIM_OC_POLARITY_NORMAL                            (0x0U << GPTIM_CCER_CCOP_Pos)
#define    FL_GPTIM_OC_POLARITY_INVERT                            (0x1U << GPTIM_CCER_CCOP_Pos)

