waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_gptim.h
/**
  * @brief
  * @rmtoll   ECR    FIDX    FL_GPTIM_GetValidIndex
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_INDEX_ONLY_THE_FIRST
  *           @arg @ref FL_GPTIM_INDEX_ALL
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetValidIndex(GPTIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, GPTIM_ECR_FIDX_Msk));
}

/**
  * @brief
  * @rmtoll   ECR    IDIR    FL_GPTIM_SetIndexDirection
  * @param    TIMx TIM instance
  * @param    dir This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_COUNT_DIRECTION_BOTH
  *           @arg @ref FL_GPTIM_COUNT_DIRECTION_UP
  *           @arg @ref FL_GPTIM_COUNT_DIRECTION_DOWN
  *           @arg @ref FL_GPTIM_COUNT_DIRECTION_NONE
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetIndexDirection(GPTIM_Type *TIMx, uint32_t dir)
{
    MODIFY_REG(TIMx->ECR, GPTIM_ECR_IDIR_Msk, dir);
}

/**
  * @brief
  * @rmtoll   ECR    IDIR    FL_GPTIM_GetIndexDirection
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_COUNT_DIRECTION_BOTH
  *           @arg @ref FL_GPTIM_COUNT_DIRECTION_UP
  *           @arg @ref FL_GPTIM_COUNT_DIRECTION_DOWN
  *           @arg @ref FL_GPTIM_COUNT_DIRECTION_NONE
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetIndexDirection(GPTIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, GPTIM_ECR_IDIR_Msk));
}

/**
  * @brief
  * @rmtoll   ECR    INDEX_EN    FL_GPTIM_EnableIndex
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_EnableIndex(GPTIM_Type *TIMx)
{
    SET_BIT(TIMx->ECR, GPTIM_ECR_INDEX_EN_Msk);
}

/**
  * @brief
  * @rmtoll   ECR    INDEX_EN    FL_GPTIM_IsEnabledIndex
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPTIM_IsEnabledIndex(GPTIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, GPTIM_ECR_INDEX_EN_Msk) == GPTIM_ECR_INDEX_EN_Msk);
}

/**
  * @brief
  * @rmtoll   ECR    INDEX_EN    FL_GPTIM_DisableIndex
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_DisableIndex(GPTIM_Type *TIMx)
{
    CLEAR_BIT(TIMx->ECR, GPTIM_ECR_INDEX_EN_Msk);
}

/**
  * @brief
  * @rmtoll   TISEL    TISEL    FL_GPTIM_SetTISource
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_TIM_TI_IN0
  *           @arg @ref FL_GPTIM_TIM_TI_IN1
  *           @arg @ref FL_GPTIM_TIM_TI_IN2
  *           @arg @ref FL_GPTIM_TIM_TI_IN3
  *           @arg @ref FL_GPTIM_TIM_TI_IN4
  *           @arg @ref FL_GPTIM_TIM_TI_IN5
  *           @arg @ref FL_GPTIM_TIM_TI_IN6
  *           @arg @ref FL_GPTIM_TIM_TI_IN7
  *           @arg @ref FL_GPTIM_TIM_TI_IN8
  *           @arg @ref FL_GPTIM_TIM_TI_IN9
  *           @arg @ref FL_GPTIM_TIM_TI_IN10
  *           @arg @ref FL_GPTIM_TIM_TI_IN11
  *           @arg @ref FL_GPTIM_TIM_TI_IN12
  *           @arg @ref FL_GPTIM_TIM_TI_IN13
  *           @arg @ref FL_GPTIM_TIM_TI_IN14
  *           @arg @ref FL_GPTIM_TIM_TI_IN15
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_TI0
  *           @arg @ref FL_GPTIM_TI1
  *           @arg @ref FL_GPTIM_TI2
  *           @arg @ref FL_GPTIM_TI3
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetTISource(GPTIM_Type *TIMx, uint32_t source, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_TI0:
            MODIFY_REG(TIMx->TISEL, (0xFU << 0U), (source));
            break;
        case FL_GPTIM_TI1:
            MODIFY_REG(TIMx->TISEL, (0xFU << 8U), (source << 8U));
            break;
        case FL_GPTIM_TI2:
            MODIFY_REG(TIMx->TISEL, (0xFU << 16U), (source << 16U));
            break;
        case FL_GPTIM_TI3:
            MODIFY_REG(TIMx->TISEL, (0xFU << 24U), (source << 24U));
            break;
    }
}

/**
  * @brief
  * @rmtoll   TISEL    TISEL    FL_GPTIM_GetTISource
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_TI0
  *           @arg @ref FL_GPTIM_TI1
  *           @arg @ref FL_GPTIM_TI2
  *           @arg @ref FL_GPTIM_TI3
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_TIM_TI_IN0
  *           @arg @ref FL_GPTIM_TIM_TI_IN1
  *           @arg @ref FL_GPTIM_TIM_TI_IN2
  *           @arg @ref FL_GPTIM_TIM_TI_IN3
  *           @arg @ref FL_GPTIM_TIM_TI_IN4
  *           @arg @ref FL_GPTIM_TIM_TI_IN5
  *           @arg @ref FL_GPTIM_TIM_TI_IN6
  *           @arg @ref FL_GPTIM_TIM_TI_IN7
  *           @arg @ref FL_GPTIM_TIM_TI_IN8
  *           @arg @ref FL_GPTIM_TIM_TI_IN9
  *           @arg @ref FL_GPTIM_TIM_TI_IN10
  *           @arg @ref FL_GPTIM_TIM_TI_IN11
  *           @arg @ref FL_GPTIM_TIM_TI_IN12
  *           @arg @ref FL_GPTIM_TIM_TI_IN13
  *           @arg @ref FL_GPTIM_TIM_TI_IN14
  *           @arg @ref FL_GPTIM_TIM_TI_IN15
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetTISource(GPTIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_TI0:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 0U)) >> 0U);
        case FL_GPTIM_TI1:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 8U)) >> 8U);
        case FL_GPTIM_TI2:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 16U)) >> 16U);
        case FL_GPTIM_TI3:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 24U)) >> 24U);
        default:
            return 0;
    }
}

/**
  * @brief
  * @rmtoll   AFR    ETRSEL    FL_GPTIM_SetETRSource
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_TIM_ETR_IN0
  *           @arg @ref FL_GPTIM_TIM_ETR_IN1
  *           @arg @ref FL_GPTIM_TIM_ETR_IN2
  *           @arg @ref FL_GPTIM_TIM_ETR_IN3
  *           @arg @ref FL_GPTIM_TIM_ETR_IN4
  *           @arg @ref FL_GPTIM_TIM_ETR_IN5
  *           @arg @ref FL_GPTIM_TIM_ETR_IN6
  *           @arg @ref FL_GPTIM_TIM_ETR_IN7
  *           @arg @ref FL_GPTIM_TIM_ETR_IN8
  *           @arg @ref FL_GPTIM_TIM_ETR_IN9
  *           @arg @ref FL_GPTIM_TIM_ETR_IN10
  *           @arg @ref FL_GPTIM_TIM_ETR_IN11
  *           @arg @ref FL_GPTIM_TIM_ETR_IN12
  *           @arg @ref FL_GPTIM_TIM_ETR_IN13
  *           @arg @ref FL_GPTIM_TIM_ETR_IN14
  *           @arg @ref FL_GPTIM_TIM_ETR_IN15
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetETRSource(GPTIM_Type *TIMx, uint32_t source)
{
    MODIFY_REG(TIMx->AFR, GPTIM_AFR_ETRSEL_Msk, source);
}

/**
  * @brief
  * @rmtoll   AFR    ETRSEL    FL_GPTIM_GetETRSource
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_TIM_ETR_IN0
  *           @arg @ref FL_GPTIM_TIM_ETR_IN1
  *           @arg @ref FL_GPTIM_TIM_ETR_IN2
  *           @arg @ref FL_GPTIM_TIM_ETR_IN3
  *           @arg @ref FL_GPTIM_TIM_ETR_IN4
  *           @arg @ref FL_GPTIM_TIM_ETR_IN5
  *           @arg @ref FL_GPTIM_TIM_ETR_IN6
  *           @arg @ref FL_GPTIM_TIM_ETR_IN7
  *           @arg @ref FL_GPTIM_TIM_ETR_IN8
  *           @arg @ref FL_GPTIM_TIM_ETR_IN9
  *           @arg @ref FL_GPTIM_TIM_ETR_IN10
  *           @arg @ref FL_GPTIM_TIM_ETR_IN11
  *           @arg @ref FL_GPTIM_TIM_ETR_IN12
  *           @arg @ref FL_GPTIM_TIM_ETR_IN13
  *           @arg @ref FL_GPTIM_TIM_ETR_IN14
  *           @arg @ref FL_GPTIM_TIM_ETR_IN15
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetETRSource(GPTIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->AFR, GPTIM_AFR_ETRSEL_Msk));
}

/**
  * @brief
  * @rmtoll   AFR    OCC1R_SEL    FL_GPTIM_SetOCREFCLRSource
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_SEL_COMP0_OUT
  *           @arg @ref FL_GPTIM_SEL_COMP1_OUT
  *           @arg @ref FL_GPTIM_SEL_COMP2_OUT
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetOCREFCLRSource(GPTIM_Type *TIMx, uint32_t source)
{
    MODIFY_REG(TIMx->AFR, GPTIM_AFR_OCCR_SEL_Msk, source);
}

/**
  * @brief
  * @rmtoll   AFR    OCC1R_SEL    FL_GPTIM_GetOCREFCLRSource
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetOCREFCLRSource(GPTIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->AFR, GPTIM_AFR_OCCR_SEL_Msk));
}

/**
  * @brief
  * @rmtoll   DCR    DBL    FL_GPTIM_SetDMABurstLength
  * @param    TIMx TIM instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_1
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_2
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_3
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_4
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_5
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_6
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_7
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_8
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_9
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_10
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_11
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_12
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_13
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_14
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_15
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_16
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_17
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_18
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_19
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_20
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_21
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_22
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_23
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetDMABurstLength(GPTIM_Type *TIMx, uint32_t length)
{
    MODIFY_REG(TIMx->DCR, GPTIM_DCR_DBL_Msk, length);
}

/**
  * @brief
  * @rmtoll   DCR    DBL    FL_GPTIM_GetDMABurstLength
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_1
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_2
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_3
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_4
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_5
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_6
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_7
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_8
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_9
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_10
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_11
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_12
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_13
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_14
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_15
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_16
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_17
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_18
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_19
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_20
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_21
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_22
  *           @arg @ref FL_GPTIM_DMA_BURST_LENGTH_23
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetDMABurstLength(GPTIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DCR, GPTIM_DCR_DBL_Msk));
}

/**
  * @brief
  * @rmtoll   DCR    DBA    FL_GPTIM_SetDMABurstAddress
  * @param    TIMx TIM instance
  * @param    address This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CR1
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CR2
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_SMCR
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_DIER
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_SR
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_EGR
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCMR1
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCMR2
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCER
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CNT
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_PSC
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_ARR
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_RCR
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCR1
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCR2
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCR3
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCR4
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_BDTR
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetDMABurstAddress(GPTIM_Type *TIMx, uint32_t address)
{
    MODIFY_REG(TIMx->DCR, GPTIM_DCR_DBA_Msk, address);
}

/**
  * @brief
  * @rmtoll   DCR    DBA    FL_GPTIM_GetDMABurstAddress
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CR1
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CR2
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_SMCR
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_DIER
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_SR
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_EGR
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCMR1
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCMR2
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCER
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CNT
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_PSC
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_ARR
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_RCR
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCR1
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCR2
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCR3
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_CCR4
  *           @arg @ref FL_GPTIM_DMA_BURST_ADDR_BDTR
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetDMABurstAddress(GPTIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DCR, GPTIM_DCR_DBA_Msk));
}

/**
  * @brief
  * @rmtoll   DMAR        FL_GPTIM_WriteDMAAddress
  * @param    TIMx TIM instance
  * @param    address
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_WriteDMAAddress(GPTIM_Type *TIMx, uint32_t address)
{
    MODIFY_REG(TIMx->DMAR, (0xffffffffU << 0U), (address << 0U));
}

/**
  * @brief
  * @rmtoll   DMAR        FL_GPTIM_ReadDMAAddress
  * @param    TIMx TIM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_GPTIM_ReadDMAAddress(GPTIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DMAR, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup GPTIM_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_GPTIM_DeInit(GPTIM_Type *TIMx);

void FL_GPTIM_StructInit(FL_GPTIM_InitTypeDef *init);
void FL_GPTIM_SlaveMode_StructInit(FL_GPTIM_SlaveInitTypeDef *slave_init);
void FL_GPTIM_OC_StructInit(FL_GPTIM_OC_InitTypeDef *oc_init);
void FL_GPTIM_IC_StructInit(FL_GPTIM_IC_InitTypeDef *ic_init);
void FL_GPTIM_ETR_StructInit(FL_GPTIM_ETR_InitTypeDef *etr_init);

FL_ErrorStatus FL_GPTIM_Init(GPTIM_Type *TIMx, FL_GPTIM_InitTypeDef *init);
FL_ErrorStatus FL_GPTIM_SlaveMode_Init(GPTIM_Type *TIMx, FL_GPTIM_SlaveInitTypeDef *slave_init);
FL_ErrorStatus FL_GPTIM_OC_Init(GPTIM_Type *TIMx, uint32_t channel, FL_GPTIM_OC_InitTypeDef *oc_init);
FL_ErrorStatus FL_GPTIM_IC_Init(GPTIM_Type *TIMx, uint32_t channel, FL_GPTIM_IC_InitTypeDef *ic_init);
FL_ErrorStatus FL_GPTIM_ETR_Init(GPTIM_Type *TIMx, FL_GPTIM_ETR_InitTypeDef *etr_init);

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FK5XX_FL_GPTIM_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-05-15*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
